// utils.ts
// Shared utility helpers for LynxHarvest scripts
// Author: Marreco

export namespace Utils {
    const VERSION = "0.1.5";
    const AUTHOR = "Marreco";
    const TOOLKIT = "Marreco Offensive Toolkit";

    // Visual Header
    export function printScriptHeader() {
        Shell.clear();
        println(" ------------------------------------------------------------");

        println("  ███╗   ███╗ █████╗ ██████╗ ██████╗ ███████╗ ██████╗ ╔█████╗ ");
        println("  ████╗ ████║██╔══██╗██╔══██╗██╔══██╗██╔════╝██╔════╝ ██   ██╗");
        println("  ██╔████╔██║███████║██████╔╝██████╔╝█████╗  ██║      ██   ██║");
        println("  ██║╚██╔╝██║██╔══██║██╔══██╗██╔══██╗██╔══╝  ██║      ██   ██║");
        println("  ██║ ╚═╝ ██║██║  ██║██║  ██║██║  ██║███████╗╚██████╗ ╚█████╔╝");
        println("  ╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝ ╚═════╝  ╚════╝");

        println(` Script   : LynxHarvest`);
        println(` Toolkit  : ${TOOLKIT}`);
        println(` Author   : ${AUTHOR}`);
        println(` Version  : ${VERSION}`);
        println(" ------------------------------------------------------------");
    }
}